// 6.  შექმენი 5 ფაილი ისე, რომ ერთ სისტემად იმუშაონ: პირველ ფაილში შექმენი user ობიექტი სახელით და საწყისი ბალანსით, მეორე ფაილში დაწერე ფუნქციები deposit და withdraw, რომლებიც შეცვლიან user-ის ბალანსს, მესამე ფაილში შექმენი transfer ფუნქცია, რომელიც აირჩევს deposit-ს ან withdraw-ს ტიპის მიხედვით, მეოთხე ფაილში დაწერე ფუნქცია, რომელიც დააბრუნებს მომხმარებლის ანგარიშის ინფორმაციას (name და balance), მეხუთე ფაილში შექმენი log ფუნქცია, რომელიც დაბეჭდავს შეტყობინებას console-ში. ბოლოს შექმენი app.js ფაილი, სადაც დააიმპორტებ ყველა საჭირო ფუნქციას და ობიექტს და გამოიყენებ ისე, რომ მომხმარებლის ბალანსი შეიცვალოს სხვადასხვა ოპერაციებით და შედეგები დაბეჭდოს console-ში.

export const user = { 
    name : "Apolon",
    balance : 100
}