// 2) მოცემულია ონლაინ მაღაზიაში მომხმარებლების მიერ დახარჯული თანხების მასივი. დაწერეთ პროგრამა, რომელიც დაადგენს რამდენი მომხმარებელი ეკუთვნის შემდეგ კატეგორიებს:
// მცირე ხარჯვა — 100-ზე ნაკლები
// საშუალო ხარჯვა — 100-დან 499-ის ჩათვლით
// დიდი ხარჯვა — 500 და მეტი
// ამოცანა შეასრულეთ forEach მეთოდის გამოყენებით.


const lst = [100 , 300 , 500 , 123, 12352 , 80 ,  10 , 234 , 456 , 12]
const users = { 
    low : 0,
    mid : 0 ,
    high: 0,

}
lst.forEach(num => {
    if ( num < 100 ) {
        users.low ++
    }
    else if ( num > 100 && num < 500) {
        users.mid ++ 
    }
    else {
        users.high ++
    }
})

console.log(users)