// 7) მოცემულია რიცხვების მასივი. დაწერეთ პროგრამა, რომელიც დაითვლის რამდენი რიცხვია 0-დან 50-მდე, რამდენი 51-დან 100-მდე და რამდენი 100-ზე მეტია. ამოცანა შეასრულეთ forEach მეთოდის გამოყენებით

const nums = [39 , 40 , 50 , 70 , 121 , 891 , 1 , 231]

const nums1 = {
    low : 0,
    mid : 0,
    high : 0
}


nums.forEach(num => {
    if ( num < 50) {
        nums1.low ++
    }
    else if ( num >= 50 && num < 100) {
        nums1.mid ++
    }
    else{
        nums1.high ++
    }
})

console.log(nums1)
